; domain
; source: https://github.com/AI-Planning/pddl-generators/blob/main/transport/domain.pddl
; updates:
;  - removed :action-costs and :functions
;  - capacity type now is size
;  - capacity-number predicate now is capacity
;  - remove the road predicate to allow fully connected graph
(define (domain transport)
  (:requirements :typing)
  (:types
        size location locatable - object
        vehicle package - locatable
  )

  (:predicates
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - size)
     (capacity-predecessor ?s1 ?s2 - size)
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (not (at ?v ?l2))
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
      )
  )

)

; problem
;; vehicles=4, packages=8, locations=11, density=1.0, fully_connected=True, max_capacity=2, out_folder=./full/training, instance_id=49, seed=90

(define (problem transport-49)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c1)
    (capacity v2 c1)
    (capacity v3 c2)
    (capacity v4 c2)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l11)
    (at p2 l6)
    (at p3 l8)
    (at p4 l10)
    (at p5 l5)
    (at p6 l5)
    (at p7 l8)
    (at p8 l5)
    (at v1 l6)
    (at v2 l2)
    (at v3 l9)
    (at v4 l3)
    )
 (:goal  (and 
    (at p1 l1)
    (at p2 l11)
    (at p3 l11)
    (at p4 l7)
    (at p5 l6)
    (at p6 l8)
    (at p7 l2)
    (at p8 l3))))

; plan
1. (drive v4 l3 l10)
   deleted: (at v4 l3)
   added: (at v4 l10)
   goals met: 0 of 8
2. (pick-up v4 l10 p4 c1 c2)
   deleted: (at p4 l10) (capacity v4 c2)
   added: (in p4 v4) (capacity v4 c1)
   goals met: 0 of 8
3. (drive v3 l9 l5)
   deleted: (at v3 l9)
   added: (at v3 l5)
   goals met: 0 of 8
4. (pick-up v3 l5 p6 c1 c2)
   deleted: (at p6 l5) (capacity v3 c2)
   added: (in p6 v3) (capacity v3 c1)
   goals met: 0 of 8
5. (pick-up v3 l5 p8 c0 c1)
   deleted: (at p8 l5) (capacity v3 c1)
   added: (in p8 v3) (capacity v3 c0)
   goals met: 0 of 8
6. (drive v3 l5 l3)
   deleted: (at v3 l5)
   added: (at v3 l3)
   goals met: 0 of 8
7. (drop v3 l3 p8 c0 c1)
   deleted: (in p8 v3) (capacity v3 c0)
   added: (at p8 l3) (capacity v3 c1)
   goals met: 1 of 8
8. (drive v3 l3 l8)
   deleted: (at v3 l3)
   added: (at v3 l8)
   goals met: 1 of 8
9. (pick-up v3 l8 p3 c0 c1)
   deleted: (at p3 l8) (capacity v3 c1)
   added: (in p3 v3) (capacity v3 c0)
   goals met: 1 of 8
10. (drop v3 l8 p6 c0 c1)
   deleted: (in p6 v3) (capacity v3 c0)
   added: (at p6 l8) (capacity v3 c1)
   goals met: 2 of 8
11. (pick-up v3 l8 p7 c0 c1)
   deleted: (at p7 l8) (capacity v3 c1)
   added: (in p7 v3) (capacity v3 c0)
   goals met: 2 of 8
12. (drive v3 l8 l2)
   deleted: (at v3 l8)
   added: (at v3 l2)
   goals met: 2 of 8
13. (drop v3 l2 p7 c0 c1)
   deleted: (in p7 v3) (capacity v3 c0)
   added: (at p7 l2) (capacity v3 c1)
   goals met: 3 of 8
14. (drive v3 l2 l5)
   deleted: (at v3 l2)
   added: (at v3 l5)
   goals met: 3 of 8
15. (pick-up v3 l5 p5 c0 c1)
   deleted: (at p5 l5) (capacity v3 c1)
   added: (in p5 v3) (capacity v3 c0)
   goals met: 3 of 8
16. (drive v3 l5 l6)
   deleted: (at v3 l5)
   added: (at v3 l6)
   goals met: 3 of 8
17. (drop v3 l6 p5 c0 c1)
   deleted: (in p5 v3) (capacity v3 c0)
   added: (at p5 l6) (capacity v3 c1)
   goals met: 4 of 8
18. (drive v4 l10 l7)
   deleted: (at v4 l10)
   added: (at v4 l7)
   goals met: 4 of 8
19. (drop v4 l7 p4 c1 c2)
   deleted: (in p4 v4) (capacity v4 c1)
   added: (at p4 l7) (capacity v4 c2)
   goals met: 5 of 8
20. (pick-up v3 l6 p2 c0 c1)
   deleted: (at p2 l6) (capacity v3 c1)
   added: (in p2 v3) (capacity v3 c0)
   goals met: 5 of 8
21. (drive v3 l6 l11)
   deleted: (at v3 l6)
   added: (at v3 l11)
   goals met: 5 of 8
22. (drop v3 l11 p2 c0 c1)
   deleted: (in p2 v3) (capacity v3 c0)
   added: (at p2 l11) (capacity v3 c1)
   goals met: 6 of 8
23. (pick-up v3 l11 p1 c0 c1)
   deleted: (at p1 l11) (capacity v3 c1)
   added: (in p1 v3) (capacity v3 c0)
   goals met: 6 of 8
24. (drop v3 l11 p3 c0 c1)
   deleted: (in p3 v3) (capacity v3 c0)
   added: (at p3 l11) (capacity v3 c1)
   goals met: 7 of 8
25. (drive v3 l11 l1)
   deleted: (at v3 l11)
   added: (at v3 l1)
   goals met: 7 of 8
26. (drop v3 l1 p1 c1 c2)
   deleted: (in p1 v3) (capacity v3 c1)
   added: (at p1 l1) (capacity v3 c2)
   goals met: 8 of 8
